BAS BMEKZU Project/src/DataProcessors/ФормированиеНалоговыхНакладныхПоРозницеБезНоменклатурногоСостава/ФормированиеНалоговыхНакладныхПоРозницеБезНоменклатурногоСостава.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ФормированиеНалоговыхНакладныхПоРозницеБезНоменклатурногоСостава</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОткрыватьДокументы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроводитьДокументы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПечататьДокументы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПечататьНаПринтер</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбособленноеПодразделение</name>
    <type>
      <types>CatalogRef.ОбособленныеПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормаРасчетов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:DataProcessor>

BAS BMEKZU Project/src/Enums/ВидыОперацийНалоговаяНакладная/ВидыОперацийНалоговаяНакладная.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийНалоговаяНакладная</name>
  <comment>(Общ)</comment>
  <enumValues>
    <name>ОблагаемыеОперации</name>
  </enumValues>
  <enumValues>
    <name>ОсвобожденныеОперации</name>
    <comment>Операции, освобожденные от НДС (п.5)</comment>
  </enumValues>
  <enumValues>
    <name>НеНДСОперации</name>
    <comment>Операции, не объекты налогообложения по НДС (п. 3.2)</comment>
  </enumValues>
  <enumValues>
    <name>ИтоговаяРозницаОблагаемыеОперации</name>
  </enumValues>
  <enumValues>
    <name>ИтоговаяРозницаОсвобожденныеОперации</name>
  </enumValues>
  <enumValues>
    <name>РозницаКонрагентуОблагаемыеОперации</name>
  </enumValues>
  <enumValues>
    <name>РозницаКонрагентуОсвобожденныеОперации</name>
  </enumValues>
  <enumValues>
    <name>УсловнаяПродажа</name>
  </enumValues>
  <enumValues>
    <name>УсловнаяПродажаСписаниеОС</name>
  </enumValues>
  <enumValues>
    <name>РаботыОтНерезидента</name>
    <comment>Работы, полученные от нерезидента</comment>
  </enumValues>
  <enumValues>
    <name>СводнаяНаПревышениеБазыНадЦенойПоставки</name>
  </enumValues>
</mdclass:Enum>

BAS BMEKZU Project/src/Enums/ВидыОперацийПриложение2КНалоговойНакладной/ВидыОперацийПриложение2КНалоговойНакладной.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийПриложение2КНалоговойНакладной</name>
  <comment>(Общ)</comment>
  <enumValues>
    <name>ОблагаемыеОперацииВозврат</name>
  </enumValues>
  <enumValues>
    <name>ОблагаемыеОперацииКорректировка</name>
  </enumValues>
  <enumValues>
    <name>ОсвобожденныеОперацииВозврат</name>
    <comment>Операции, освобожденные от НДС (п.5)</comment>
  </enumValues>
  <enumValues>
    <name>ОсвобожденныеОперацииКорректировка</name>
    <comment>Операции, освобожденные от НДС (п.5)</comment>
  </enumValues>
  <enumValues>
    <name>НеНДСОперацииВозврат</name>
    <comment>Операции, не объекты налогообложения по НДС (п. 3.2)</comment>
  </enumValues>
  <enumValues>
    <name>НеНДСОперацииКорректировка</name>
    <comment>Операции, не объекты налогообложения по НДС (п. 3.2)</comment>
  </enumValues>
  <enumValues>
    <name>ИтоговаяРозницаОблагаемыеОперацииВозврат</name>
  </enumValues>
  <enumValues>
    <name>ИтоговаяРозницаОсвобожденныеОперацииВозврат</name>
  </enumValues>
  <enumValues>
    <name>РозницаКонрагентуОблагаемыеОперацииВозврат</name>
  </enumValues>
  <enumValues>
    <name>РозницаКонрагентуОсвобожденныеОперацииВозврат</name>
  </enumValues>
  <enumValues>
    <name>РаботыОтНерезидентаКорректировка</name>
    <comment>Работы, полученные от нерезидента</comment>
  </enumValues>
  <enumValues>
    <name>УсловнаяПродажаВозврат</name>
  </enumValues>
  <enumValues>
    <name>СводнаяНаПревышениеБазыНадЦенойПоставки</name>
  </enumValues>
</mdclass:Enum>

BAS BMEKZU Project/src/DataProcessors/ФормированиеНалоговыхНакладныхПоРозницеБезНоменклатурногоСостава/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ЗаполнитьШапку(Настройки, Документ, НалоговаяНакладная = Неопределено)

	Документ.Дата 		 = КонецДня(Настройки.Дата)-2;
	Документ.Организация = Настройки.Организация;
	
	Если ТипЗнч(Документ) = Тип("ДокументОбъект.НалоговаяНакладная") Тогда
		Документ.ОбособленноеПодразделение = Настройки.ОбособленноеПодразделение;
	КонецЕсли;
	
	Документ.ВалютаДокумента = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьВалютуРегламентированногоУчета();
	
	Документ.СуммаВключаетНДС 	= Истина;
	Документ.АвторасчетНДС 		= Ложь;
	
	Документ.Ответственный 				  = Пользователи.ТекущийПользователь();
	Документ.КтоВыписалНалоговуюНакладную = БухгалтерскийУчетПереопределяемый.ПолучитьЗначениеПоУмолчанию("КтоВыписалНалоговуюНакладную");	
	
	Документ.СчетНДС 		= ПланыСчетов.Хозрасчетный.РасчетыПоНДС;
	Документ.СчетУчетаНДС 	= ПланыСчетов.Хозрасчетный.НалоговыеОбязательстваРозница;
	
	Документы.НалоговаяНакладная.УстановитьТипПричиныНевыдачиПокупателюПоУмолчанию(Документ);
	
	Если НЕ НалоговаяНакладная = Неопределено Тогда
	    // Свяжем Налоговую накладную и Приложение 2
		Документ.НалоговаяНакладная = НалоговаяНакладная.Ссылка;
	
	КонецЕсли;
	
	Документ.ФормаРасчетов = Настройки.ФормаРасчетов;
	
КонецПроцедуры

Процедура ОбработатьДокумент(Настройки, Документ, СписокСозданныхДокументов)

	
	Если Настройки.ПроводитьДокументы Тогда
		Попытка
			Документ.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			Документ.Записать();
		КонецПопытки;
		
		
	Иначе
		Документ.Записать();
	КонецЕсли;

	СписокСозданныхДокументов.Добавить(Документ.Ссылка);
	
КонецПроцедуры

Функция СформироватьНалоговыеДокументыПоРознице(Настройки) Экспорт
	
	Перем ДокументОблагаемые, 		 ДокументОсвобожденные;
	Перем ДокументОблагаемыеВозврат, ДокументОсвобожденныеВозврат;
	
	СписокСозданныхДокументов = Новый Массив();
	
	МоментПолученияДанных = Новый Граница(КонецДня(Настройки.Дата), ВидГраницы.Включая);
	
	// Облагаемые НДС операции
	ДокументОблагаемые = Документы.НалоговаяНакладная.СоздатьДокумент();
	
	ДокументОблагаемые.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ИтоговаяРозницаОблагаемыеОперации;
	ЗаполнитьШапку(Настройки, ДокументОблагаемые);
	
	ДокументОблагаемые.ЗаполнитьПоОстаткам(ДокументОблагаемые.Товары, МоментПолученияДанных);
	Если ДокументОблагаемые.Товары.Количество() = 0 Тогда
		ДокументОблагаемые = Неопределено;
	Иначе
		ОбработатьДокумент(Настройки, ДокументОблагаемые, СписокСозданныхДокументов);
	КонецЕсли;
	
	// Освобожденные от НДС операции
	ДокументОсвобожденные = Документы.НалоговаяНакладная.СоздатьДокумент();
	
	ДокументОсвобожденные.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ИтоговаяРозницаОсвобожденныеОперации;
	ЗаполнитьШапку(Настройки, ДокументОсвобожденные);
	
	ДокументОсвобожденные.ЗаполнитьПоОстаткам(ДокументОсвобожденные.Товары, МоментПолученияДанных);
	Если ДокументОсвобожденные.Товары.Количество() = 0 Тогда
		ДокументОсвобожденные = Неопределено;
	Иначе
		ОбработатьДокумент(Настройки, ДокументОсвобожденные, СписокСозданныхДокументов);
	КонецЕсли;
	
	
	// Облагаемые НДС операции (возврат)
	ДокументОблагаемыеВозврат = Документы.Приложение2КНалоговойНакладной.СоздатьДокумент();
	
	ДокументОблагаемыеВозврат.ВидОперации = Перечисления.ВидыОперацийПриложение2КНалоговойНакладной.ИтоговаяРозницаОблагаемыеОперацииВозврат;
	ЗаполнитьШапку(Настройки, ДокументОблагаемыеВозврат, ДокументОблагаемые);
	
	ДокументОблагаемыеВозврат.ЗаполнитьПоОстаткам(ДокументОблагаемыеВозврат.Товары, МоментПолученияДанных);
	Если ДокументОблагаемыеВозврат.Товары.Количество() = 0 Тогда
		ДокументОблагаемыеВозврат = Неопределено;
	Иначе
		ОбработатьДокумент(Настройки, ДокументОблагаемыеВозврат, СписокСозданныхДокументов);
	КонецЕсли;
	
	
	// Освобожденные от НДС операции возврат
	ДокументОсвобожденныеВозврат = Документы.Приложение2КНалоговойНакладной.СоздатьДокумент();
	
	ДокументОсвобожденныеВозврат.ВидОперации = Перечисления.ВидыОперацийПриложение2КНалоговойНакладной.ИтоговаяРозницаОсвобожденныеОперацииВозврат;
	ЗаполнитьШапку(Настройки, ДокументОсвобожденныеВозврат, ДокументОсвобожденные);
	
	ДокументОсвобожденныеВозврат.ЗаполнитьПоОстаткам(ДокументОсвобожденныеВозврат.Товары, МоментПолученияДанных);
	Если ДокументОсвобожденныеВозврат.Товары.Количество() = 0 Тогда
		ДокументОсвобожденныеВозврат = Неопределено;
	Иначе
		ОбработатьДокумент(Настройки, ДокументОсвобожденныеВозврат, СписокСозданныхДокументов);
	КонецЕсли;
	
	Возврат СписокСозданныхДокументов;
	
КонецФункции

#КонецЕсли
